renesas/ArduinoCore-rl78g23_fpb_128p/cores/rl78g23_128p/HardwareUart.cpp
    if(SERIAL_PARITY_EVEN == (SERIAL_PARITY_MASK & config))
    {
        if(( _urt_channel == 0 ) || ( _urt_channel == 2 ) || ( _urt_channel == 3 ) || ( _urt_channel == 4 ))
        {
            converted_config |= _0200_SAU_PARITY_EVEN;
        }
        else
        {
            converted_config |= _60_UARTA_PARITY_EVEN;
        }
    }
    else if(SERIAL_PARITY_ODD == (SERIAL_PARITY_MASK & config))
    {
        if(( _urt_channel == 0 ) || ( _urt_channel == 2 ) || ( _urt_channel == 3 ) || ( _urt_channel == 4 ))
        {
            converted_config |= _0300_SAU_PARITY_ODD;
        }
        else
        {
            converted_config |= _40_UARTA_PARITY_ODD;
        }
    }
    else
    {
        /* All other settings are treated as SERIAL_PARITY_NONE(default). */
        if(( _urt_channel == 0 ) || ( _urt_channel == 2 ) || ( _urt_channel == 3 ) || ( _urt_channel == 4 ))
        {
            converted_config |= _0000_SAU_PARITY_NONE;
        }
        else
        {
            converted_config |= _00_UARTA_PARITY_NONE;
        }
    }

    switch (_urt_channel)
    {
        /* Rewriting prohibited when SEmn = 1 / Set_Config is called between R_Config_UART0_Create () and R_Config_UART0_Start (), so SEmn = 0*/
        case 0: // UART0
        {
        /* SCR00 16bit*/
#if ( UART_CHANNEL == 0 )
            unsigned short SCR00data=_8000_SAU_TRANSMISSION |_0000_SAU_INTSRE_MASK |_0004_SAU_SCRMN_INITIALVALUE |_0080_SAU_LSB | converted_config;
            /* When sending, _0000_SAU_INTSRE_MASK :EOCmn = 0*/
            unsigned short SCR01data=_4000_SAU_RECEPTION |_0400_SAU_INTSRE_ENABLE |_0004_SAU_SCRMN_INITIALVALUE |_0080_SAU_LSB | converted_config;
            /* _0400_SAU_INTSRE_ENABLE: EOCmn = 1 Allow the occurrence of the error interrupt INTSREx */

            /* SLCmn1: 0 SLCmn0: 1 when receiving XXXXXXXXXX01XXXX*/
            SCR01data &= ~(_0020_SAU_STOP_2);
            SCR01data |= _0010_SAU_STOP_1;

            SCR00 = SCR00data;
            SCR01 = SCR01data;
#endif /* ( UART_CHANNEL == 0 ) */
            break;
        }
        case 1:  // UARTA1
        {
#if ( UART1_CHANNEL == 1 )
            unsigned short ASIMA11data = _02_UARTA_DIRECTION_LSB | _00_UARTA_DATA_NORMAL | converted_config;
            ASIMA11 = (unsigned char)ASIMA11data;
            break;
        }
#endif /* ( UART1_CHANNEL == 1 ) */
        case 2:  //UART2
        {
#if ( UART2_CHANNEL == 2 )
            unsigned short SCR10data=_8000_SAU_TRANSMISSION| _0000_SAU_INTSRE_MASK |_0004_SAU_SCRMN_INITIALVALUE |_0080_SAU_LSB |converted_config;
            unsigned short SCR11data=_4000_SAU_RECEPTION| _0400_SAU_INTSRE_ENABLE |_0004_SAU_SCRMN_INITIALVALUE |_0080_SAU_LSB |converted_config;
            /* SLCmn1: 0 SLCmn0: 1 when receiving XXXXXXXXXX01XXXX*/
            SCR11data &= ~(_0020_SAU_STOP_2);
            SCR11data |= _0010_SAU_STOP_1;
            SCR10 = SCR10data;
            SCR11 = SCR11data;
#endif /* ( UART2_CHANNEL == 2 ) */
            break;
        }
        case 3:  //UART1
        {
#if ( UART3_CHANNEL == 3 )
            unsigned short SCR02data=_8000_SAU_TRANSMISSION| _0000_SAU_INTSRE_MASK |_0004_SAU_SCRMN_INITIALVALUE |_0080_SAU_LSB |converted_config;
            unsigned short SCR03data=_4000_SAU_RECEPTION| _0400_SAU_INTSRE_ENABLE |_0004_SAU_SCRMN_INITIALVALUE |_0080_SAU_LSB |converted_config;
            /* SLCmn1: 0 SLCmn0: 1 when receiving XXXXXXXXXX01XXXX*/
            SCR03data &= ~(_0020_SAU_STOP_2);
            SCR03data |= _0010_SAU_STOP_1;

            SCR02 = SCR02data;
            SCR03 = SCR03data;
#endif /* ( UART3_CHANNEL == 3 ) */
            break;
        }
        case 4:  //UART3
        {
#if ( UART4_CHANNEL == 4 )
            unsigned short SCR12data=_8000_SAU_TRANSMISSION| _0000_SAU_INTSRE_MASK |_0004_SAU_SCRMN_INITIALVALUE |_0080_SAU_LSB |converted_config;
            unsigned short SCR13data=_4000_SAU_RECEPTION| _0400_SAU_INTSRE_ENABLE |_0004_SAU_SCRMN_INITIALVALUE |_0080_SAU_LSB |converted_config;
            /* SLCmn1: 0 SLCmn0: 1 when receiving XXXXXXXXXX01XXXX*/
            SCR13data &= ~(_0020_SAU_STOP_2);
            SCR13data |= _0010_SAU_STOP_1;

            SCR12 = SCR12data;
            SCR13 = SCR13data;
#endif /* ( UART4_CHANNEL == 4 ) */
            break;
        }
        case 5:  // UARTA0
        {
#if ( UART5_CHANNEL == 5 )
            unsigned short ASIMA01data = _02_UARTA_DIRECTION_LSB | _00_UARTA_DATA_NORMAL | converted_config;
            ASIMA01 = (unsigned char)ASIMA01data;
#endif /* ( UART5_CHANNEL == 5 ) */
            break;
        }
    }
}
/**********************************************************************************************************************
 End of function Set_Config
 *********************************************************************************************************************/
#endif /* __RL78__ */

/**********************************************************************************************************************
 * Function Name: HardwareUart::Set_SerialPort
 * Description  : Set serial port pins for the target port.
 * Arguments    : txd_pin - transmit pin no.
 *              : rxd_pin - receive  pin no.
 * Return Value : void
 *********************************************************************************************************************/
void HardwareUart::Set_SerialPort(uint8_t txd_pin,uint8_t rxd_pin)
{
    __far const PinTableType * __far const *pp;
    __far PinTableType * p;

    /* Set RxD pin */
    //getPinTable(rxd_pin,p);
    pp = &pinTablelist[rxd_pin];
    p = (__far PinTableType *)*pp;
    /* Set PM Register for Input */
    *p->portModeRegisterAddr |=  (unsigned long)(0x1 << p->bit);

#if defined(G22_FPB) || defined(G23_FPB)
    /* Set PMCA Register */
    if (0!=p->pmca)
    {
        *p->portModeControlARegisterAddr &= (unsigned long)~(p->pmca);
    }
#endif // defined(G22_FPB) || defined(G23_FPB)

    /* Set PMCT Register */
#if defined(G22_FPB) || defined(G23_FPB)
    if (0!=p->pmct)
    {
        *p->portModeControlTRegisterAddr &= (unsigned long)~(p->pmct);
    }
#endif // defined(G22_FPB) || defined(G23_FPB)

    /* Set PMCE Register for Output */
#if defined(G23_FPB)
    if (0!=p->pmce)
    {
        *p->portModeControlERegisterAddr &= (unsigned long)~(p->pmce);
    }
#endif // G23_FPB
    /* Set CCDE Register for Digital InOut */
#if defined(G23_FPB)
    if (0!=p->ccde)
    {
        CCDE &= (uint8_t)~(p->ccde);
    }
#endif // G23_FPB
#if defined(G16_FPB)
    if (0!=p->pmc)
    {
        *p->portModeControlRegisterAddr &= (unsigned long)~(p->pmc);
    }
#endif // defined(G16_FPB)

    /* Set TxD pin */
    //getPinTable(txd_pin,p);
    pp = &pinTablelist[txd_pin];
    p = (__far PinTableType *)*pp;
    /* Set PMCE Register t */
#if defined(G23_FPB)
    if (0!=p->pmce)
    {
        *p->portModeControlERegisterAddr &= (unsigned long)~(p->pmce);
    }
#endif // G23_FPB

    /* Set P Register for Set "H" Output Port*/
    *p->portRegisterAddr |= (unsigned long)(0x1 << p->bit);

    /* Set PM Register for Output */
    *p->portModeRegisterAddr &= (unsigned long)~(0x1 << p->bit);

    /* Set PMCA Register */
#if defined(G22_FPB) || defined(G23_FPB)
    if (0!=p->pmca)
    {
        *p->portModeControlARegisterAddr &= (unsigned long)~(p->pmca);
    }
#endif // defined(G22_FPB) || defined(G23_FPB)

    /* Set PMCT Register */
#if defined(G22_FPB) || defined(G23_FPB)
    if (0!=p->pmct)
    {
        *p->portModeControlTRegisterAddr &= (unsigned long)~(p->pmct);
    }
#endif // defined(G22_FPB) || defined(G23_FPB)

    /* Set PMCE Register t */
#if defined(G23_FPB)
    if (0!=p->pmce)
    {
        *p->portModeControlERegisterAddr &= (unsigned long)~(p->pmce);
    }
#endif // G23_FPB
    /* Set CCDE Register for Digital InOut */
#if defined(G23_FPB)
    if (0!=p->ccde)
    {
        CCDE &= (uint8_t)~(p->ccde);
    }
#endif // G23_FPB

